app/controllers/images_controller.rb

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 12]]
SELECT  1 AS one FROM "images" INNER JOIN "matches" ON "images"."id" = "matches"."matched_image_id" WHERE "matches"."image_id" = $1 AND "images"."id" = $2 LIMIT 1  [["image_id", 1], ["id", 12]]
SELECT  1 AS one FROM "matches" WHERE "matches"."matched_image_id" = $1 AND "matches"."image_id" = $2 LIMIT 1  [["matched_image_id", 1], ["image_id", 12]]
SELECT "matches".* FROM "matches" WHERE "matches"."matched_image_id" = $1 AND "matches"."image_id" = $2  [["matched_image_id", 1], ["image_id", 12]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 3]]
INSERT INTO "matches" ("matched_image_id", "image_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["matched_image_id", 1], ["image_id", 12], ["created_at", "2016-08-26 01:42:35.094362"], ["updated_at", "2016-08-26 01:42:35.094362"]]
---
  def toggle_match
    if match = Image.find_by_id(params[:match_id])
      if @image.matched_images.include?(match)
        @image.matched_images.delete(match)
      else
        @image.matched_images << match

SELECT "images".* FROM "images" JOIN taggings images_taggings_4bc1f28  ON images_taggings_4bc1f28.taggable_id = "images".id AND images_taggings_4bc1f28.taggable_type = 'Image' AND images_taggings_4bc1f28.tag_id = 12 JOIN taggings images_taggings_39e454e  ON images_taggings_39e454e.taggable_id = "images".id AND images_taggings_39e454e.taggable_type = 'Image' AND images_taggings_39e454e.tag_id = 14 JOIN taggings images_taggings_f84e984  ON images_taggings_f84e984.taggable_id = "images".id AND images_taggings_f84e984.taggable_type = 'Image' AND images_taggings_f84e984.tag_id = 16 JOIN taggings images_taggings_1c404c6  ON images_taggings_1c404c6.taggable_id = "images".id AND images_taggings_1c404c6.taggable_type = 'Image' AND images_taggings_1c404c6.tag_id = 19
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('manga') OR LOWER(name) = LOWER('usagi') OR LOWER(name) = LOWER('rei') OR LOWER(name) = LOWER('minako'))
---
  def index
    if @tag.present?
      @images = Image.tagged_with(@tag)
    else
      @tag = []
      @images = Image.all

INSERT INTO "images" ("file_file_name", "file_content_type", "file_file_size", "file_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @image = Image.new({:file=>params[:file]})

    if @image.save

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('cute') OR LOWER(name) = LOWER('alone') OR LOWER(name) = LOWER('90s anime') OR LOWER(name) = LOWER('bookmark') OR LOWER(name) = LOWER('venus') OR LOWER(name) = LOWER('sailormoon r') OR LOWER(name) = LOWER('2 girls'))
INSERT INTO "tags" ("name") VALUES ($1) RETURNING "id"  [["name", "2 girls"]]
UPDATE "tags" SET "taggings_count" = COALESCE("taggings_count", 0) - 1 WHERE "tags"."id" = $1  [["id", 24]]
---
  def toggle_tag
    tag = params[:tag].try(:downcase)
    if tag.present?
      if @image.tag_list.include?(tag)
        @image.tag_list.remove(tag)
      else
        @image.tag_list.add(tag)
      end
      @image.save

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 6]]
---
    def set_image
      @image = Image.find(params[:id])