app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "name", "password_salt", "crypted_password", "persistence_token", "single_access_token", "perishable_token", "login_count", "current_login_at", "current_login_ip", "last_request_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)