app/views/images/index.html.erb

SELECT "tags"."name" FROM "tags"
---
        <option>Add a filter</option>
        <%ActsAsTaggableOn::Tag.pluck('name').sort.each do |tag|%>